Revit 2027 API
OffsetSurface.IsOrientationSameAsBasisSurface Method
 Indicates whether the orientation of the OffsetSurface is same as that of its basis surface, in the sense that their oriented normals at any (u, v) have the same direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOrientationSameAsBasisSurface()
Public Function IsOrientationSameAsBasisSurface As Boolean
public:
bool IsOrientationSameAsBasisSurface()
member IsOrientationSameAsBasisSurface : unit -> bool
Return Value
Boolean
 True if the orientation of the OffsetSurface is same as that of its basis surface, false otherwise.
See Also
Reference
OffsetSurface Class
Autodesk.Revit.DB Namespace